Учет_кабельной_продукции/src/Documents/ЗаявкиНаЗакупки/ЗаявкиНаЗакупки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкиНаЗакупки</name>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.ДанныеПоЗаявкамНаЗакупку</registerRecords>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаявкиНаЗакупку</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подрядчик</name>
    <type>
      <types>CatalogRef.Подрядчик</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>299</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КабельныеЛинии</name>
    <attributes>
      <name>ЖурналУчетаКП</name>
      <type>
        <types>CatalogRef.ЖурналыУчетаКабельнойПродукции</types>
      </type>
    </attributes>
    <attributes>
      <name>КабельнаяЛиния</name>
      <type>
        <types>CatalogRef.КабельныеЛинии</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерВКНаКПП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>299</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Учет_кабельной_продукции/src/Enums/СтатусыЗаявкиНаЗакупку/СтатусыЗаявкиНаЗакупку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаявкиНаЗакупку</name>
  <enumValues>
    <name>ОжидаетЗаявку</name>
  </enumValues>
  <enumValues>
    <name>ЗаключениеДоговора</name>
  </enumValues>
  <enumValues>
    <name>Изготовление</name>
  </enumValues>
  <enumValues>
    <name>Доставка</name>
  </enumValues>
  <enumValues>
    <name>Поставлено</name>
  </enumValues>
</mdclass:Enum>

Учет_кабельной_продукции/src/Documents/ЗаявкиНаЗакупки/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;                    
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	
	Выборка = Справочники.Подрядчик.Выбрать();	
	Пока Выборка.Следующий() Цикл
		СписокВыбораПодрядчика.Добавить(Выборка.Ссылка, Выборка.Ссылка);		
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы   
&НаКлиенте
Процедура СоздатьДокументы(Команда)
	
	ПараметрыОбъекта = Новый Структура;
	ПараметрыОбъекта.Вставить("Форма", ЭтотОбъект);
	ПараметрыОбъекта.Вставить("СписокВыбораПодрядчика", СписокВыбораПодрядчика);
	ПараметрыОбъекта.Вставить("ИмяОбъекта", "ЗаявкиНаЗакупку");	
	ПараметрыОбъекта.Вставить("ОтборыКабельныхЛиний", "ПоРегиструЗаданияЗакупкиПринятыеКабельныеЛинии");	
	ПараметрыОбъекта.Вставить("Подрядчик", ОбщегоНазначенияПереопределяемый.ПодрядчикТекущегоПользователя());	    		
	ФормыДокументовОбработчикиКоманд.ВыборПодрядчикаИКабельныеЛинии(ПараметрыОбъекта);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура УстановитьУсловноеОформление()

	//СтандартныеПодсистемыСервер.УстановитьУсловноеОформлениеПоляДата(ЭтотОбъект, "Список.Дата", Элементы.СписокДата.Имя);

КонецПроцедуры

&НаСервереБезКонтекста
Функция СоздатьЗаявкуНаЗакупки(Подрядчик, СписокКабельныхЛиний) Экспорт
	
	НоваяЗаявка           = Документы.ЗаявкиНаЗакупки.СоздатьДокумент();
	НоваяЗаявка.Дата      = ТекущаяДатаСеанса();
	НоваяЗаявка.Статус    = Перечисления.СтатусыЗаявкиНаЗакупку.ОжидаетЗаявку; 
	НоваяЗаявка.Подрядчик = Подрядчик;
	
	Для каждого ТекКабельнаяЛиния Из СписокКабельныхЛиний Цикл
		НовКабельнаяЛиния                = НоваяЗаявка.КабельныеЛинии.Добавить();
		НовКабельнаяЛиния.КабельнаяЛиния = ТекКабельнаяЛиния.Значение;
	КонецЦикла;
	
	НоваяЗаявка.Записать();
	
	Возврат НоваяЗаявка.Ссылка; 
	
КонецФункции
#КонецОбласти
